{
  "ir_version": "0.7.0",
  "reflection_enabled": true,
  "app_id": "cb4aef7b-1f54-41a2-8999-55d9367a9304",
  "name": "Hello User",
  "description": "A slightly personalized Hello World.",
  "auth": {
    "provider": "stub",
    "scopes": [
      "app.view"
    ],
    "roles": [
      {
        "name": "Anonymous",
        "scopes": [
          "app.view"
        ]
      },
      {
        "name": "user",
        "scopes": [
          "app.view"
        ]
      }
    ]
  },
  "content": [
    {
      "name": {
        "display": "compute audit log sayhelloto",
        "snake": "compute_audit_log_sayhelloto",
        "pascal": "ComputeAuditLogSayhelloto"
      },
      "fields": [
        {
          "name": "compute_name",
          "display_name": "compute name",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "invocation_id",
          "display_name": "invocation id",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "trigger",
          "display_name": "trigger",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "started_at",
          "display_name": "started at",
          "business_type": "datetime",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "completed_at",
          "display_name": "completed at",
          "business_type": "datetime",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "duration_ms",
          "display_name": "duration ms",
          "business_type": "number",
          "column_type": "REAL",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "outcome",
          "display_name": "outcome",
          "business_type": "enum",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [
            "success",
            "error",
            "timeout",
            "cancelled"
          ],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "total_input_tokens",
          "display_name": "total input tokens",
          "business_type": "number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "total_output_tokens",
          "display_name": "total output tokens",
          "business_type": "number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "trace",
          "display_name": "trace",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        },
        {
          "name": "error_message",
          "display_name": "error message",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "one_of_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null,
          "default_expr": null,
          "confidentiality_scopes": []
        }
      ],
      "singular": "",
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null,
      "confidentiality_scopes": [],
      "audit": "none",
      "dependent_values": []
    }
  ],
  "access_grants": [],
  "state_machines": [],
  "events": [],
  "routes": [
    {
      "method": "GET",
      "path": "/api/v1/compute_audit_log_sayhelloto",
      "kind": "LIST",
      "content_ref": "compute_audit_log_sayhelloto",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/compute_audit_log_sayhelloto/{id}",
      "kind": "GET_ONE",
      "content_ref": "compute_audit_log_sayhelloto",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": null
    }
  ],
  "pages": [
    {
      "name": "Hello",
      "slug": "hello",
      "role": "Anonymous",
      "required_scope": null,
      "children": [
        {
          "type": "text",
          "props": {
            "content": "Anon, Hello!"
          },
          "style": {},
          "layout": {},
          "children": []
        }
      ]
    },
    {
      "name": "Hello",
      "slug": "hello",
      "role": "user",
      "required_scope": null,
      "children": [
        {
          "type": "text",
          "props": {
            "content": {
              "value": "SayHelloTo(User.FirstName)",
              "is_expr": true
            }
          },
          "style": {},
          "layout": {},
          "children": []
        }
      ]
    }
  ],
  "nav_items": [],
  "streams": [],
  "computes": [
    {
      "name": {
        "display": "SayHelloTo",
        "snake": "sayhelloto",
        "pascal": "Sayhelloto"
      },
      "shape": "TRANSFORM",
      "input_content": [
        "text"
      ],
      "output_content": [
        "text"
      ],
      "body_lines": [
        "greeting = \"Hello, \" + name + \"!\""
      ],
      "required_scope": null,
      "required_role": "user",
      "input_params": [
        {
          "name": "name",
          "type_name": "text"
        }
      ],
      "output_params": [
        {
          "name": "greeting",
          "type_name": "text"
        }
      ],
      "client_safe": true,
      "identity_mode": "delegate",
      "required_confidentiality_scopes": [],
      "output_confidentiality_scope": null,
      "field_dependencies": [],
      "provider": null,
      "preconditions": [],
      "postconditions": [],
      "directive": null,
      "objective": null,
      "strategy": null,
      "trigger": null,
      "trigger_where": null,
      "accesses": [],
      "input_fields": [],
      "output_fields": [],
      "output_creates": null,
      "audit_level": "actions",
      "audit_scope": null,
      "audit_content_ref": "compute_audit_log_sayhelloto"
    }
  ],
  "channels": [],
  "boundaries": [],
  "error_handlers": [],
  "reclassification_points": []
}