{
  "ir_version": "0.2.0",
  "reflection_enabled": true,
  "name": "Warehouse Inventory Manager",
  "description": "Track products and stock levels across warehouses",
  "auth": {
    "provider": "stub",
    "scopes": [
      "read inventory",
      "write inventory",
      "admin inventory"
    ],
    "roles": [
      {
        "name": "warehouse clerk",
        "scopes": [
          "read inventory",
          "write inventory"
        ]
      },
      {
        "name": "warehouse manager",
        "scopes": [
          "read inventory",
          "write inventory",
          "admin inventory"
        ]
      },
      {
        "name": "executive",
        "scopes": [
          "read inventory"
        ]
      }
    ]
  },
  "content": [
    {
      "name": {
        "display": "products",
        "snake": "products",
        "pascal": "Products"
      },
      "fields": [
        {
          "name": "sku",
          "display_name": "SKU",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": true,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null
        },
        {
          "name": "name",
          "display_name": "name",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null
        },
        {
          "name": "description",
          "display_name": "description",
          "business_type": "text",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null
        },
        {
          "name": "unit_cost",
          "display_name": "unit cost",
          "business_type": "currency",
          "column_type": "REAL",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null
        },
        {
          "name": "category",
          "display_name": "category",
          "business_type": "enum",
          "column_type": "TEXT",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [
            "raw material",
            "finished good",
            "packaging"
          ],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null
        }
      ],
      "storage_intent": "auto",
      "has_state_machine": true,
      "initial_state": "draft"
    },
    {
      "name": {
        "display": "stock levels",
        "snake": "stock_levels",
        "pascal": "StockLevels"
      },
      "fields": [
        {
          "name": "product",
          "display_name": "product",
          "business_type": "reference",
          "column_type": "INTEGER",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": "products",
          "is_auto": false,
          "list_type": null
        },
        {
          "name": "warehouse",
          "display_name": "warehouse",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null
        },
        {
          "name": "quantity",
          "display_name": "quantity",
          "business_type": "whole_number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": 0,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null
        },
        {
          "name": "reorder_threshold",
          "display_name": "reorder threshold",
          "business_type": "whole_number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": 0,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null
        }
      ],
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null
    },
    {
      "name": {
        "display": "reorder alerts",
        "snake": "reorder_alerts",
        "pascal": "ReorderAlerts"
      },
      "fields": [
        {
          "name": "product",
          "display_name": "product",
          "business_type": "reference",
          "column_type": "INTEGER",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": "products",
          "is_auto": false,
          "list_type": null
        },
        {
          "name": "warehouse",
          "display_name": "warehouse",
          "business_type": "text",
          "column_type": "TEXT",
          "required": true,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null
        },
        {
          "name": "current_quantity",
          "display_name": "current quantity",
          "business_type": "whole_number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null
        },
        {
          "name": "threshold",
          "display_name": "threshold",
          "business_type": "whole_number",
          "column_type": "INTEGER",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": false,
          "list_type": null
        },
        {
          "name": "created_at",
          "display_name": "created at",
          "business_type": "automatic",
          "column_type": "TIMESTAMP",
          "required": false,
          "unique": false,
          "minimum": null,
          "maximum": null,
          "enum_values": [],
          "foreign_key": null,
          "is_auto": true,
          "list_type": null
        }
      ],
      "storage_intent": "auto",
      "has_state_machine": false,
      "initial_state": null
    }
  ],
  "access_grants": [
    {
      "content": "products",
      "scope": "read inventory",
      "verbs": [
        "view"
      ]
    },
    {
      "content": "products",
      "scope": "write inventory",
      "verbs": [
        "create",
        "update"
      ]
    },
    {
      "content": "products",
      "scope": "admin inventory",
      "verbs": [
        "delete"
      ]
    },
    {
      "content": "stock_levels",
      "scope": "read inventory",
      "verbs": []
    },
    {
      "content": "stock_levels",
      "scope": "write inventory",
      "verbs": []
    },
    {
      "content": "reorder_alerts",
      "scope": "read inventory",
      "verbs": []
    },
    {
      "content": "reorder_alerts",
      "scope": "write inventory",
      "verbs": []
    },
    {
      "content": "reorder_alerts",
      "scope": "admin inventory",
      "verbs": []
    }
  ],
  "state_machines": [
    {
      "content_ref": "products",
      "machine_name": "product lifecycle",
      "initial_state": "draft",
      "states": [
        "draft",
        "active",
        "discontinued"
      ],
      "transitions": [
        {
          "from_state": "draft",
          "to_state": "active",
          "required_scope": "write inventory"
        },
        {
          "from_state": "active",
          "to_state": "discontinued",
          "required_scope": "admin inventory"
        },
        {
          "from_state": "discontinued",
          "to_state": "active",
          "required_scope": "admin inventory"
        }
      ],
      "primitive_type": "content"
    }
  ],
  "events": [
    {
      "source_content": "stock_levels",
      "trigger": "jexl",
      "condition": null,
      "action": {
        "target_content": "reorder_alerts",
        "column_mapping": [
          [
            "product",
            "product"
          ],
          [
            "warehouse",
            "warehouse"
          ],
          [
            "current_quantity",
            "quantity"
          ],
          [
            "threshold",
            "reorder_threshold"
          ]
        ]
      },
      "jexl_condition": "stockLevel.updated && stockLevel.quantity <= stockLevel.reorderThreshold",
      "log_level": "INFO"
    }
  ],
  "routes": [
    {
      "method": "GET",
      "path": "/api/v1/products",
      "kind": "LIST",
      "content_ref": "products",
      "required_scope": "read inventory",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/products",
      "kind": "CREATE",
      "content_ref": "products",
      "required_scope": "write inventory",
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/products/{sku}",
      "kind": "GET_ONE",
      "content_ref": "products",
      "required_scope": "read inventory",
      "lookup_column": "sku",
      "target_state": null
    },
    {
      "method": "PUT",
      "path": "/api/v1/products/{sku}",
      "kind": "UPDATE",
      "content_ref": "products",
      "required_scope": "write inventory",
      "lookup_column": "sku",
      "target_state": null
    },
    {
      "method": "DELETE",
      "path": "/api/v1/products/{sku}",
      "kind": "DELETE",
      "content_ref": "products",
      "required_scope": "admin inventory",
      "lookup_column": "sku",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/products/{sku}/activate",
      "kind": "TRANSITION",
      "content_ref": "products",
      "required_scope": null,
      "lookup_column": "sku",
      "target_state": "active"
    },
    {
      "method": "POST",
      "path": "/api/v1/products/{sku}/discontinue",
      "kind": "TRANSITION",
      "content_ref": "products",
      "required_scope": null,
      "lookup_column": "sku",
      "target_state": "discontinued"
    },
    {
      "method": "GET",
      "path": "/api/v1/stock-levels",
      "kind": "LIST",
      "content_ref": "stock_levels",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/stock-levels",
      "kind": "CREATE",
      "content_ref": "stock_levels",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "PUT",
      "path": "/api/v1/stock-levels/{id}",
      "kind": "UPDATE",
      "content_ref": "stock_levels",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "GET",
      "path": "/api/v1/alerts",
      "kind": "LIST",
      "content_ref": "reorder_alerts",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": null
    },
    {
      "method": "POST",
      "path": "/api/v1/alerts/{id}/acknowledge",
      "kind": "LIST",
      "content_ref": "reorder_alerts",
      "required_scope": null,
      "lookup_column": "id",
      "target_state": null
    }
  ],
  "pages": [
    {
      "name": "Inventory Dashboard",
      "slug": "inventory_dashboard",
      "role": "warehouse clerk",
      "display_content": "products",
      "table_columns": [
        {
          "display": "SKU",
          "key": "sku"
        },
        {
          "display": "name",
          "key": "name"
        },
        {
          "display": "category",
          "key": "category"
        },
        {
          "display": "status",
          "key": "status"
        }
      ],
      "filters": [
        {
          "key": "category",
          "display": "category",
          "filter_type": "enum",
          "options": [
            "raw material",
            "finished good",
            "packaging"
          ]
        },
        {
          "key": "warehouse",
          "display": "warehouse",
          "filter_type": "distinct",
          "options": []
        },
        {
          "key": "status",
          "display": "status",
          "filter_type": "status",
          "options": [
            "draft",
            "active",
            "discontinued"
          ]
        }
      ],
      "search_fields": [
        "sku",
        "name"
      ],
      "highlight": {
        "field": "",
        "operator": "lte",
        "threshold_field": ""
      },
      "subscribe_stream": "stock level",
      "related": {
        "related_content": "stock_levels",
        "join_column": "product",
        "display_columns": [
          "warehouse"
        ]
      },
      "form_fields": [],
      "form_target_content": null,
      "create_as_status": null,
      "validate_unique_field": null,
      "after_save_instruction": null,
      "aggregations": [],
      "chart": null,
      "required_scope": null,
      "static_texts": [],
      "static_expressions": []
    },
    {
      "name": "Receive Stock",
      "slug": "receive_stock",
      "role": "warehouse clerk",
      "display_content": null,
      "table_columns": [],
      "filters": [],
      "search_fields": [],
      "highlight": null,
      "subscribe_stream": null,
      "related": null,
      "form_fields": [
        {
          "key": "product",
          "display": "product",
          "input_type": "reference",
          "required": true,
          "minimum": null,
          "step": null,
          "enum_values": [],
          "reference_content": "products",
          "reference_display_col": "name",
          "reference_unique_col": "sku"
        },
        {
          "key": "warehouse",
          "display": "warehouse",
          "input_type": "text",
          "required": true,
          "minimum": null,
          "step": null,
          "enum_values": [],
          "reference_content": null,
          "reference_display_col": null,
          "reference_unique_col": null
        },
        {
          "key": "quantity",
          "display": "quantity",
          "input_type": "number",
          "required": false,
          "minimum": 0,
          "step": null,
          "enum_values": [],
          "reference_content": null,
          "reference_display_col": null,
          "reference_unique_col": null
        },
        {
          "key": "reorder_threshold",
          "display": "reorder threshold",
          "input_type": "number",
          "required": false,
          "minimum": 0,
          "step": null,
          "enum_values": [],
          "reference_content": null,
          "reference_display_col": null,
          "reference_unique_col": null
        }
      ],
      "form_target_content": "stock_levels",
      "create_as_status": null,
      "validate_unique_field": null,
      "after_save_instruction": "return to the Inventory Dashboard",
      "aggregations": [],
      "chart": null,
      "required_scope": null,
      "static_texts": [],
      "static_expressions": []
    },
    {
      "name": "Reorder Alerts",
      "slug": "reorder_alerts",
      "role": "warehouse clerk",
      "display_content": "reorder_alerts",
      "table_columns": [
        {
          "display": "product",
          "key": "product"
        },
        {
          "display": "warehouse",
          "key": "warehouse"
        },
        {
          "display": "current quantity",
          "key": "current_quantity"
        },
        {
          "display": "threshold",
          "key": "threshold"
        },
        {
          "display": "created at",
          "key": "created_at"
        }
      ],
      "filters": [
        {
          "key": "warehouse",
          "display": "warehouse",
          "filter_type": "distinct",
          "options": []
        }
      ],
      "search_fields": [],
      "highlight": null,
      "subscribe_stream": "reorder alerts",
      "related": null,
      "form_fields": [],
      "form_target_content": null,
      "create_as_status": null,
      "validate_unique_field": null,
      "after_save_instruction": null,
      "aggregations": [],
      "chart": null,
      "required_scope": null,
      "static_texts": [],
      "static_expressions": []
    },
    {
      "name": "Add Product",
      "slug": "add_product",
      "role": "warehouse manager",
      "display_content": null,
      "table_columns": [],
      "filters": [],
      "search_fields": [],
      "highlight": null,
      "subscribe_stream": null,
      "related": null,
      "form_fields": [
        {
          "key": "sku",
          "display": "SKU",
          "input_type": "text",
          "required": true,
          "minimum": null,
          "step": null,
          "enum_values": [],
          "reference_content": null,
          "reference_display_col": null,
          "reference_unique_col": null
        },
        {
          "key": "name",
          "display": "name",
          "input_type": "text",
          "required": true,
          "minimum": null,
          "step": null,
          "enum_values": [],
          "reference_content": null,
          "reference_display_col": null,
          "reference_unique_col": null
        },
        {
          "key": "description",
          "display": "description",
          "input_type": "text",
          "required": false,
          "minimum": null,
          "step": null,
          "enum_values": [],
          "reference_content": null,
          "reference_display_col": null,
          "reference_unique_col": null
        },
        {
          "key": "unit_cost",
          "display": "unit cost",
          "input_type": "currency",
          "required": false,
          "minimum": null,
          "step": "0.01",
          "enum_values": [],
          "reference_content": null,
          "reference_display_col": null,
          "reference_unique_col": null
        },
        {
          "key": "category",
          "display": "category",
          "input_type": "enum",
          "required": false,
          "minimum": null,
          "step": null,
          "enum_values": [
            "raw material",
            "finished good",
            "packaging"
          ],
          "reference_content": null,
          "reference_display_col": null,
          "reference_unique_col": null
        }
      ],
      "form_target_content": "products",
      "create_as_status": "draft",
      "validate_unique_field": "",
      "after_save_instruction": "offer to set initial stock levels per warehouse",
      "aggregations": [],
      "chart": null,
      "required_scope": "write inventory",
      "static_texts": [],
      "static_expressions": []
    },
    {
      "name": "Inventory Overview",
      "slug": "inventory_overview",
      "role": "executive",
      "display_content": null,
      "table_columns": [],
      "filters": [],
      "search_fields": [],
      "highlight": null,
      "subscribe_stream": null,
      "related": null,
      "form_fields": [],
      "form_target_content": null,
      "create_as_status": null,
      "validate_unique_field": null,
      "after_save_instruction": null,
      "aggregations": [
        {
          "key": "total_product_count_with_activ",
          "description": "total product count with active vs discontinued breakdown",
          "agg_type": "count_by_status",
          "content_ref": "products",
          "join_content": null,
          "join_column": null,
          "sum_expression": null
        }
      ],
      "chart": {
        "content_ref": "reorder_alerts",
        "days": 30,
        "chart_type": "line"
      },
      "required_scope": null,
      "static_texts": [],
      "static_expressions": []
    }
  ],
  "nav_items": [
    {
      "label": "Dashboard",
      "page_slug": "inventory_dashboard",
      "visible_to": [
        "all"
      ],
      "badge_content": null
    },
    {
      "label": "Receive Stock",
      "page_slug": "receive_stock",
      "visible_to": [
        "clerk",
        "manager"
      ],
      "badge_content": null
    },
    {
      "label": "Alerts",
      "page_slug": "reorder_alerts",
      "visible_to": [
        "all"
      ],
      "badge_content": "reorder_alerts"
    },
    {
      "label": "Add Product",
      "page_slug": "add_product",
      "visible_to": [
        "manager"
      ],
      "badge_content": null
    },
    {
      "label": "Overview",
      "page_slug": "inventory_overview",
      "visible_to": [
        "executive"
      ],
      "badge_content": null
    }
  ],
  "streams": [
    {
      "description": "stock updates and alerts",
      "path": "/api/v1/stream"
    }
  ],
  "computes": [],
  "channels": [],
  "boundaries": [],
  "error_handlers": []
}
